<section
                    class="rounded-2xl border border-slate-120 px-8 shadow-12 max-lg:mb-0 max-lg:rounded-none max-lg:px-0 max-lg:shadow-none py-12 max-lg:border-0 max-lg:py-0">

                    <div class="flex items-center max-lg:flex-col justify-between mb-12 max-lg:mb-4 max-lg:gap-5">

                        <div
                            class="flex items-center gap-4 max-lg:w-full max-lg:flex-row-reverse max-lg:justify-between">
                            <svg xmlns="http://www.w3.org/2000/svg" width="31" height="33" viewBox="0 0 31 33"
                                fill="none" class="text-primaryColor mx-0">
                                <path
                                    d="M2.38462 28.2825C2.38462 29.5336 2.88709 30.7336 3.78149 31.6183C4.67589 32.503 5.88897 33 7.15385 33H14.0096C14.0887 33 14.1645 32.9689 14.2204 32.9136C14.2763 32.8583 14.3077 32.7834 14.3077 32.7052V19.1423C14.3077 19.0641 14.2763 18.9891 14.2204 18.9338C14.1645 18.8785 14.0887 18.8474 14.0096 18.8474H2.98077C2.82266 18.8474 2.67103 18.9096 2.55922 19.0201C2.44742 19.1307 2.38462 19.2807 2.38462 19.4371V28.2825ZM14.3077 16.1938V8.233H16.6923V16.1938C16.6923 16.272 16.7237 16.347 16.7796 16.4023C16.8355 16.4576 16.9113 16.4887 16.9904 16.4887H27.4231C27.8293 16.4887 28.2325 16.4201 28.6154 16.286C29.3122 16.0413 29.9154 15.5894 30.3423 14.9922C30.7692 14.3951 30.9989 13.6819 31 12.9505V11.7711C31 10.8328 30.6231 9.93283 29.9523 9.2693C29.2815 8.60577 28.3717 8.233 27.4231 8.233H24.4021C24.3761 8.23259 24.3507 8.22548 24.3284 8.21238C24.3061 8.19927 24.2876 8.18062 24.2748 8.15828C24.262 8.13594 24.2553 8.11068 24.2554 8.085C24.2555 8.05932 24.2624 8.03411 24.2754 8.01187C24.9653 6.85968 25.1894 5.49209 24.9027 4.18333C24.616 2.87456 23.8397 1.72139 22.7295 0.95502C21.6193 0.188655 20.2573 -0.134239 18.9165 0.051083C17.5757 0.236405 16.3553 0.916242 15.5 1.95428C14.6447 0.916242 13.4243 0.236405 12.0835 0.051083C10.7427 -0.134239 9.38068 0.188655 8.27048 0.95502C7.16028 1.72139 6.384 2.87456 6.09731 4.18333C5.81061 5.49209 6.03469 6.85968 6.72462 8.01187C6.7376 8.03411 6.74449 8.05932 6.74459 8.085C6.7447 8.11068 6.73802 8.13594 6.72522 8.15828C6.71242 8.18062 6.69394 8.19927 6.67162 8.21238C6.64929 8.22548 6.62389 8.23259 6.59793 8.233H3.57692C2.62826 8.233 1.71846 8.60577 1.04766 9.2693C0.376853 9.93283 0 10.8328 0 11.7711V12.9505C0.00105238 13.6819 0.230788 14.3951 0.657709 14.9922C1.08463 15.5894 1.68783 16.0413 2.38462 16.286C2.7675 16.4201 3.17072 16.4887 3.57692 16.4887H14.0096C14.0887 16.4887 14.1645 16.4576 14.2204 16.4023C14.2763 16.347 14.3077 16.272 14.3077 16.1938ZM16.6923 5.28455C16.6923 4.7014 16.8671 4.13135 17.1947 3.64648C17.5222 3.16161 17.9877 2.7837 18.5324 2.56054C19.077 2.33738 19.6764 2.27899 20.2546 2.39276C20.8328 2.50652 21.3639 2.78734 21.7808 3.19968C22.1977 3.61203 22.4816 4.1374 22.5966 4.70934C22.7116 5.28128 22.6526 5.87412 22.4269 6.41288C22.2013 6.95164 21.8193 7.41212 21.3291 7.7361C20.8389 8.06008 20.2626 8.233 19.6731 8.233H16.6923V5.28455ZM11.1138 2.34347C11.5222 2.31452 11.9322 2.36908 12.3183 2.50377C12.7044 2.63846 13.0583 2.85038 13.358 3.12632C13.6576 3.40226 13.8966 3.7363 14.06 4.10763C14.2234 4.47895 14.3077 4.87958 14.3077 5.28455V8.233H11.3269C10.5562 8.23105 9.81613 7.93384 9.26215 7.40377C8.70816 6.8737 8.38329 6.15196 8.35571 5.39005C8.32814 4.62813 8.6 3.88527 9.11425 3.31737C9.6285 2.74946 10.3452 2.39994 11.1138 2.34347ZM16.9904 33H23.8462C25.111 33 26.3241 32.503 27.2185 31.6183C28.1129 30.7336 28.6154 29.5336 28.6154 28.2825V19.4371C28.6154 19.2807 28.5526 19.1307 28.4408 19.0201C28.329 18.9096 28.1773 18.8474 28.0192 18.8474H16.9904C16.9113 18.8474 16.8355 18.8785 16.7796 18.9338C16.7237 18.9891 16.6923 19.0641 16.6923 19.1423V32.7052C16.6923 32.7834 16.7237 32.8583 16.7796 32.9136C16.8355 32.9689 16.9113 33 16.9904 33Z"
                                    fill="currentColor" />
                            </svg>
                            <span class="text-[20px] font-[900]">اعتبار تخفیف</span>
                        </div>

                        <div class="text-[#889BAD] text-[16px] font-[700]">
                            تا کنون 5,556,000 تومان اعتبار تخفیف از اسکیپ زوم دریافت کرده اید.
                        </div>

                    </div>

                    <div class="flex flex-col">
                        <div
                            class="w-full border border-slate-120 max-lg:border-b-slate-120 px-8 py-4 shadow-12 rounded-2xl grid grid-cols-12 items-center max-lg:gap-2 max-lg:px-4 max-lg:py-4">

                            <div class="text-right col-span-7 max-lg:col-span-12 text-[20px] font-[900] text-[#5091FB]">
                                کد اعتبار تخفیف را وارد کنید:
                            </div>

                            <div class="text-[#4E5C6D] col-span-5 max-lg:col-span-12 text-[16px] max-lg:text-left">
                                <form class="flex gap-3">
                                    <input type="text" class="border rounded-lg grow px-2" />
                                    <button type="submit"
                                        class="flex items-center justify-center bg-[#02C96F] text-white rounded-lg px-6 gap-2.5 max-lg:px-4 text-[14px] font-[600]">
                                        افزودن اعتبار
                                        <svg xmlns="http://www.w3.org/2000/svg" width="17" height="17"
                                            viewBox="0 0 17 17" fill="none">
                                            <g filter="url(#filter0_d_27564_16291)">
                                                <path
                                                    d="M12.5201 6.38201H8.6586V2.65366C8.6586 2.35701 8.53655 2.07252 8.3193 1.86276C8.10205 1.653 7.80739 1.53516 7.50015 1.53516C7.19291 1.53516 6.89826 1.653 6.68101 1.86276C6.46376 2.07252 6.34171 2.35701 6.34171 2.65366V6.38201H2.48022C2.17298 6.38201 1.87833 6.49985 1.66108 6.70961C1.44383 6.91937 1.32178 7.20386 1.32178 7.50051C1.32178 7.79716 1.44383 8.08165 1.66108 8.29141C1.87833 8.50117 2.17298 8.61901 2.48022 8.61901H6.34171V12.3474C6.34171 12.644 6.46376 12.9285 6.68101 13.1383C6.89826 13.348 7.19291 13.4659 7.50015 13.4659C7.80739 13.4659 8.10205 13.348 8.3193 13.1383C8.53655 12.9285 8.6586 12.644 8.6586 12.3474V8.61901H12.5201C12.8273 8.61901 13.122 8.50117 13.3392 8.29141C13.5565 8.08165 13.6785 7.79716 13.6785 7.50051C13.6785 7.20386 13.5565 6.91937 13.3392 6.70961C13.122 6.49985 12.8273 6.38201 12.5201 6.38201Z"
                                                    fill="white" />
                                            </g>
                                            <defs>
                                                <filter id="filter0_d_27564_16291" x="0.321777" y="0.535156"
                                                    width="16.3569" height="15.9297" filterUnits="userSpaceOnUse"
                                                    color-interpolation-filters="sRGB">
                                                    <feFlood flood-opacity="0" result="BackgroundImageFix" />
                                                    <feColorMatrix in="SourceAlpha" type="matrix"
                                                        values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                                                        result="hardAlpha" />
                                                    <feOffset dx="1" dy="1" />
                                                    <feGaussianBlur stdDeviation="1" />
                                                    <feComposite in2="hardAlpha" operator="out" />
                                                    <feColorMatrix type="matrix"
                                                        values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.2 0" />
                                                    <feBlend mode="normal" in2="BackgroundImageFix"
                                                        result="effect1_dropShadow_27564_16291" />
                                                    <feBlend mode="normal" in="SourceGraphic"
                                                        in2="effect1_dropShadow_27564_16291" result="shape" />
                                                </filter>
                                            </defs>
                                        </svg>
                                    </button>
                                </form>
                            </div>

                        </div>
                        <div class="flex justify-between mt-2.5 max-lg:flex-col max-lg">

                            <span class="text-[#04B968] flex items-center justify-center max-lg:justify-start gap-x-2">
                                <svg xmlns="http://www.w3.org/2000/svg" width="12" height="8" viewBox="0 0 12 8"
                                    fill="none" class="mx-0">
                                    <path d="M1 4L3.59123 6.66527C3.77446 6.85373 4.07233 6.86814 4.2729 6.69825L11 1"
                                        stroke="#04B968" stroke-width="2" stroke-linecap="round" />
                                </svg>
                                کد اعتبار تخفیف شما ثبت شد.
                            </span>

                            <span class="text-[#BF9A00] flex items-center justify-center max-lg:justify-start gap-x-2">
                                <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20"
                                    fill="none" class="mx-0">
                                    <path opacity="0.4"
                                        d="M8.35815 3.04953C9.07148 1.75953 10.9256 1.75953 11.639 3.04953L18.094 14.717C18.7856 15.967 17.8815 17.5004 16.4531 17.5004H3.54482C2.11565 17.5004 1.21148 15.967 1.90315 14.717L8.35815 3.04953Z"
                                        fill="#EFC101" />
                                    <path
                                        d="M10.7755 13.8394C10.8157 13.9435 10.8346 14.0545 10.8311 14.166C10.8242 14.3821 10.7336 14.5871 10.5783 14.7376C10.423 14.888 10.2152 14.9722 9.999 14.9722C9.78277 14.9722 9.57502 14.888 9.41972 14.7376C9.26442 14.5871 9.17376 14.3821 9.16692 14.166C9.16339 14.0545 9.1823 13.9435 9.22253 13.8394C9.26276 13.7354 9.32348 13.6405 9.4011 13.5604C9.47871 13.4803 9.57164 13.4166 9.67435 13.3731C9.77706 13.3296 9.88746 13.3072 9.999 13.3072C10.1105 13.3072 10.221 13.3296 10.3237 13.3731C10.4264 13.4166 10.5193 13.4803 10.5969 13.5604C10.6745 13.6405 10.7352 13.7354 10.7755 13.8394Z"
                                        fill="#09192D" />
                                    <path
                                        d="M10.3903 7.22207C10.5133 7.32201 10.5937 7.4649 10.6153 7.62184L10.6211 7.70601L10.6244 11.4577C10.6246 11.6161 10.5646 11.7687 10.4565 11.8845C10.3485 12.0004 10.2005 12.0709 10.0424 12.0818C9.88439 12.0927 9.72809 12.0432 9.60517 11.9433C9.48224 11.8433 9.40185 11.7005 9.38025 11.5435L9.37442 11.4585L9.37109 7.70768C9.37092 7.54925 9.43093 7.39667 9.53897 7.2808C9.64701 7.16493 9.79502 7.09442 9.95307 7.08351C10.1111 7.07261 10.2674 7.12213 10.3903 7.22207Z"
                                        fill="#09192D" />
                                </svg>
                                تعداد دفعات استفاده از این کد اعتبار تکمیل شده است.
                            </span>

                        </div>
                    </div>

                    <hr class="my-[30px]">

                    <div class="flex flex-col lg:gap-y-6">
                        <div
                            class="w-full border border-slate-120 max-lg:border-transparent max-lg:border-b-slate-120 max-lg:rounded-none max-lg:shadow-none px-8 max-lg:px-0 py-4 shadow-12 rounded-2xl grid grid-cols-12 items-center max-lg:gap-5 max-lg:py-8">

                            <div class="text-right col-span-3 max-lg:col-span-6">
                                <span class="text-textColor text-3xl font-black">1,000,000</span>
                                <span class="text-[#889BAD] text-[16px] mr-1">تومان</span>
                            </div>

                            <div class="text-[#4E5C6D] col-span-4 max-lg:col-span-6 text-[16px] max-lg:text-left">
                                اعتبار بابت ارتقاء سطح شما
                            </div>

                            <div class="flex justify-between col-span-5 max-lg:col-span-12">
                                <div
                                    class="bg-primaryColor/10 text-primaryColor rounded py-0.5 px-2 flex items-center gap-2">
                                    <span class="text-[10px] font-[700]">استفاده شده</span>
                                    <span class="text-[16px] font-[700]">200,000</span>
                                </div>
                                <div
                                    class="bg-emerald-500/10 text-emerald-500 rounded py-0.5 px-2 flex items-center gap-2">
                                    <span class="text-[10px] font-[700]">مانده</span>
                                    <span class="text-[16px] font-[700]">800,000</span>
                                </div>
                                <div class="rounded py-0.5 px-2 flex items-center gap-2">
                                    <span class="text-[15px] font-[700] text-[#4E5C6D]">انقضا</span>
                                    <span
                                        class="text-[16px] font-[700] text-textColor max-lg:text-base">1403.06.28</span>
                                </div>
                            </div>
                        </div>
                    </div>

                </section>