import Svg, { Circle, Path } from "react-native-svg";
import { IconProps } from "./IconProps";

/** آیکن شیپور / اطلاع‌رسانی داخل دایره آبی روشن */
export function Trumpet({ size = 44, width, height, ...props }: IconProps) {
  const w = width ?? size;
  const h = height ?? size;
  return (
    <Svg width={w} height={h} viewBox="0 0 44 44" fill="none" {...props}>
      <Circle cx="22" cy="22" r="22" fill="#5091FB" fillOpacity={0.1} />
      <Path
        d="M17.6309 13.9229C16.7964 13.4373 15.7511 14.0386 15.751 15.0029V27.2617C15.751 28.2918 16.9264 28.88 17.751 28.2617H17.752L19.8105 26.7158C21.0732 25.7692 22.5248 25.4907 23.874 25.2607C24.5959 25.1377 24.8889 25.1349 25.3281 25.1025C25.7539 25.0711 26.3915 25.0073 27.877 24.7598C29.1136 24.5536 29.8105 23.9106 30.3145 23.3154C30.7893 22.7547 31.0986 22.0724 31.207 21.3457C31.3154 20.6192 31.2189 19.8769 30.9287 19.2021C30.6383 18.5272 30.1648 17.9463 29.5625 17.5254C28.9604 17.1046 28.253 16.8602 27.5195 16.8193L24.501 16.6514C22.9058 16.5627 21.3544 16.0963 19.9746 15.291L17.6309 13.9229Z"
        stroke="#3F7FF5"
        strokeWidth={1.5}
        fill="none"
      />
      <Path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M28 25L26.355 30.0792C26.2759 30.3734 26.0985 30.6275 25.8557 30.7945C25.6128 30.9615 25.321 31.0302 25.0339 30.9878C24.7469 30.9454 24.4841 30.7948 24.2941 30.5638C24.104 30.3329 23.9996 30.0371 24 29.7312V25.3604L26.6374 25.2052C27.0961 25.176 27.5518 25.1074 28 25Z"
        stroke="#3F7FF5"
        strokeWidth={1.5}
        fill="none"
      />
      <Path
        d="M24 25.5V17"
        stroke="#3F7FF5"
        strokeWidth={1.5}
        fill="none"
      />
      <Path
        d="M15.25 18.8809C14.3766 19.19 13.75 20.0207 13.75 21C13.75 21.9792 14.3767 22.8089 15.25 23.1182V18.8809Z"
        stroke="#3F7FF5"
        strokeWidth={1.5}
        fill="none"
      />
    </Svg>
  );
}
