<?php
/**
 * Shop module (migrated from saeed-codes.php).
 */
if ( ! defined( 'ABSPATH' ) ) {
	exit;
}

/****************************************************************************************************************************************/
/****************************************************************************************************************************************/
/*=====================================================================*/
// حذف پیام پیش‌فرض ووکامرس

/****************************************************************************************************************************************/
add_action( 'init', function() {
    register_post_status( 'wc-completed-paid', array(
        'label'                     => 'پرداخت کامل',
        'public'                    => true,
        'show_in_admin_status_list' => true,
        'show_in_admin_all_list'    => true,
        'label_count'               => _n_noop( 'پرداخت کامل <span class="count">(%s)</span>', 'پرداخت کامل <span class="count">(%s)</span>' ),
    ) );
});

// افزودن به لیست استاتوس‌های ووکامرس
add_filter( 'wc_order_statuses', function( $statuses ) {
    $statuses['wc-completed-paid'] = 'پرداخت کامل';
    return $statuses;
} );
/****************************************************************************************************************************************/
